app/controllers/comments_controller.rb

  def create
    @comment = Comment.new(comment_params.merge(post_id:params[:post_id])) #added post_id section 21.3. 9.32


    respond_to do |format|
      if @comment.save
---
INSERT INTO "comments" ("post_id", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["post_id", 1], ["body", "This is great!"], ["created_at", "2023-01-26 10:07:10.688528"], ["updated_at", "2023-01-26 10:07:10.688528"]]

  def update
    respond_to do |format|
      if @comment.update(comment_params)
---
UPDATE "comments" SET "post_id" = ?, "updated_at" = ? WHERE "comments"."id" = ?  [["post_id", 5], ["updated_at", "2023-03-20 17:49:24.384314"], ["id", 4]]