app/controllers/usernames_controller.rb

SELECT "usernames".* FROM "usernames"
---
  def index
    @usernames = Username.all